12/data/attachments/34ca55b26c4fe811.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Sheila_important_Friend_11557_5</nif:username>
            <nif:friendToBeRequested>soap_friends_96174e0f-7c12-4fd6-8959-083d7615408d</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>